In [1]:
import pandas as pd #pd is context manager

In [2]:
a = [1,7,2] #list
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [3]:
print(myvar[1])

7

In [4]:
a = [1,7,2]
myvar = pd.Series(a, index=["x", "y", "z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

index changed from 0,1,2.... to xyz but in backend it is still stored from 0,1,2..

In [5]:
print(myvar["y"])

7

In [6]:
print(myvar[1])

7

C:\Users\Aman\AppData\Local\Temp\ipykernel_17012\2320585734.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(myvar[1])

In [7]:
#Key/Value Objects as Series
calories = {"day1": 420, "day2": 380, "day3":390}

myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [8]:
#every key will be an index position
print(myvar['day2'])

380

In [9]:
calories = {"day1": 420, "day2": 380, "day3":390}
myvar = pd.Series(calories, index=["day1", "day3"])
print(myvar)

day1    420
day3    390
dtype: int64

In [10]:
calories = {"day1": 420, "day2": 380, "day3":390}
myvar = pd.Series(calories, index=["x", "y", "z"])
print(myvar)

x   NaN
y   NaN
z   NaN
dtype: float64

As there is no key of xyz according to the data, it gives error in dictionary.

In [11]:
calories = {"day1": 420, "day2": 380, "day3":390}
myvar = pd.Series(calories, index=[1, 2, 3,"day1"])
print(myvar)

1         NaN
2         NaN
3         NaN
day1    420.0
dtype: float64

## Data Frames

In [12]:
data = {
    "calories": [420,380,390],
    "duration": [50,40,45]
}

df = pd.DataFrame(data)
print(df)

df.shape

   calories  duration
0       420        50
1       380        40
2       390        45

(3, 2)

In [13]:
data = {
    "calories": [420,380,390],
    "duration": [50,40,45]
}

df = pd.DataFrame(data, index= ["day1", "day2", "day3"])
print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [14]:
calories = {"day1": 420, "day2": 380, "day3":390}
myvar = pd.DataFrame(calories,index=[1])
print(myvar)

   day1  day2  day3
1   420   380   390

In [15]:
#list into dataframe

lst = ["My", "name", "is", "aman", "negi"]

df = pd.DataFrame(lst)

df

      0
0    My
1  name
2    is
3  aman
4  negi

In [16]:
#list into dataframe

lst = ["My", "name", "is", "aman", "negi"]

df = pd.DataFrame(lst, columns = ["details"])

df

  details
0      My
1    name
2      is
3    aman
4    negi

In [17]:
#joining multiple lists
lst1 = ["My", "name", "is", "aman", "negi"]

lst2 = [2,4,8,9,6]

list(zip(lst1,lst2))#tuples inside list

[('My', 2), ('name', 4), ('is', 8), ('aman', 9), ('negi', 6)]

In [18]:
#convert multiple lists into dataframe

lst1 = ["My", "name", "is", "aman", "negi"]

lst2 = [2,4,8,9,6]

df = pd.DataFrame(list(zip(lst1,lst2)), columns = ["Details", "Val"])

df

  Details  Val
0      My    2
1    name    4
2      is    8
3    aman    9
4    negi    6

In [19]:
#convert a list of lists (multidimensional) into dataframe

lst = [['nikhil', 36], ["rupali", 30], ["deep", 28], ["prithvish", 35]]

df = pd.DataFrame(lst, columns=["Name", "Age"])

df

        Name  Age
0     nikhil   36
1     rupali   30
2       deep   28
3  prithvish   35